//#include "structs.h"
//
//Employee emp1 = {"Иванов", "Алексей", "Петрович", "Продавец автомобилей", "095-123-4567", "ivanov.alex@gmail.com"};
//Employee emp2 = {"Петров", "Сергей", "Александрович", "Менеджер по продажам", "067-987-6543", "petrov.sergey@gmail.com"};
//Employee emp3 = {"Сидоров", "Павел", "Иванович", "Автоконсультант", "050-111-2222", "sidorov.pavel@gmail.com"};
//Employee emp4 = {"Коваленко", "Елена", "Викторовна", "Финансовый менеджер", "093-555-6666", "kovalenko.elena@gmail.com"};
//
//Car car1 = {"Audi", "A4", "F3487", 2023, 45000.0, 48000.0};
//Car car2 = {"BMW",  "X5", "A1447", 2022, 60000.0, 65000.0};
//Car car3 = {"Toyota", "Camry", "B8372", 2024, 35000.0, 38000.0};
//Car car4 = {"Mercedes-Benz", "C-Class", "G7239", 2023, 50000.0, 55000.0};
//
//Sale sale1 = {
//        {"Иванов", "Алексей", "Петрович"}, // Информация о сотруднике
//        {"Audi", "A4", "F3487"}, // Информация о машине
//        {19, 3, 2024},
//        47000.0,
//        2000,// Реальная цена продажи
//        1
//};
//Sale sale2 = {
//        {"Петров", "Сергей", "Александрович"}, // Информация о сотруднике
//        {"BMW", "X5", "A1447"}, // Информация о машине
//        {25, 5, 2024},
//        62000.0,
//        2000,// Реальная цена продажи
//        2
//};
//Sale sale3 = {
//        {"Сидоров", "Павел", "Иванович"}, // Информация о сотруднике
//        {"Toyota", "Camry", "B8372"}, // Информация о машине
//        {12, 8, 2024},
//        36000.0,
//        2000,// Реальная цена продажи
//        3
//};
//Sale sale4 = {
//        {"Коваленко", "Елена", "Викторовна"}, // Информация о сотруднике
//        {"Mercedes-Benz", "C-Class", "G7239"}, // Информация о машине
//        {8, 6, 2023},
//        53000.0,
//        2000,// Реальная цена продажи
//        4
//};
//Sale sale5 = {
//        {"Иванов", "Алексей", "Петрович"}, // Информация о сотруднике
//        {"Audi", "A4", "F3487"}, // Информация о машине
//        {8, 9, 2024}, // Дата продажи
//        49000.0, // Цена продажи
//        2000, // Реальная цена продажи
//        5
//};
//Sale sale6 = {
//        {"Петров", "Сергей", "Александрович"}, // Информация о сотруднике
//        {"BMW", "X5", "A1447"}, // Информация о машине
//        {15, 10, 2023}, // Дата продажи
//        61000.0, // Цена продажи
//        2000, // Реальная цена продажи
//        6
//};
//
//Sale sale7 = {
//        {"Иванов", "Алексей", "Петрович"}, // Информация о сотруднике
//        {"Toyota", "Camry", "B8372"}, // Информация о машине
//        {12, 8, 2023}, // Дата продажи
//        37000.0, // Цена продажи
//        2000, // Реальная цена продажи
//        7
//};
//Sale sale8 = {
//        {"Иванов", "Алексей", "Петрович"}, // Информация о сотруднике
//        {"Mercedes-Benz", "C-Class", "G7239"}, // Информация о машине
//        {28, 6, 2024}, // Дата продажи
//        52000.0, // Цена продажи
//        2000, // Реальная цена продажи
//        8
//};
//
//
//
//Employee staticArrEpl[4] = {
//    emp1, emp2, emp3, emp4
//};
//
//Car staticArrCar[4] = {
//        car1, car2, car3, car4
//};
//
//Sale staticArrSales[8] = {
//        sale1, sale2, sale3, sale4, sale5, sale6, sale7, sale8
//};
