#include "structs.h"

Employee emp1 = {"Иванов", "Алексей", "Петрович", "Продавец автомобилей", "095-123-4567", "ivanov.alex@gmail.com"};
Employee emp2 = {"Петров", "Сергей", "Александрович", "Менеджер по продажам", "067-987-6543", "petrov.sergey@gmail.com"};

Car car1 = {"Audi", 2023, "A4", 45000.0, 48000.0, "F3487"};
Car car2 = {"BMW", 2022, "X5", 60000.0, 65000.0, "A1447"};

Sale sale1 = {
        {"Иванов", "Алексей", "Петрович"}, // Информация о сотруднике
        {"Audi", 2023, "A4", 45000.0, 48000.0, "F3487"}, // Информация о машине
        {19, 3, 2024},
        47000.0 // Реальная цена продажи
};
Sale sale2 = {
        {"Петров", "Сергей", "Александрович"}, // Информация о сотруднике
        {"BMW", 2022, "X5", 60000.0, 65000.0, "A1447"}, // Информация о машине
        {25, 5, 2024},
        62000.0 // Реальная цена продажи
};


// собираем в массивы
const int sizeStaticArr = 2;
Employee staticArrEpl[sizeStaticArr] = {
    emp1, emp2
};

Car staticArrCar[sizeStaticArr] = {
        car1, car2
};

Sale staticArrSales[sizeStaticArr] = {
        sale1, sale2
};
